2026.03.24.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-24 Tue 10:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2026.03.17.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2026.03.31.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of March 17 to 24, 2026.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">Introducing atdml (experimental)</a></li>
<li><a href="#2">Experimental module imports in ATD (ATD 4.0.0)</a></li>
<li><a href="#3">Dune 3.22</a></li>
<li><a href="#4">Parseff: parser combinator library for OCaml 5</a></li>
<li><a href="#5">Outreachy Demo Day for December 2025 Round</a></li>
<li><a href="#org45c9929">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">Introducing atdml (experimental)</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-introducing-atdml-experimental/17908/1">https://discuss.ocaml.org/t/ann-introducing-atdml-experimental/17908/1</a>
</p>
</div>
<div id="outline-container-org007e4c6" class="outline-3">
<h3 id="org007e4c6">Martin Jambon announced</h3>
<div class="outline-text-3" id="text-org007e4c6">
<p>
ATD 4.0.0 was released today on opam.
</p>

<p>
This release introduces <b>atdml</b>, an experimental replacement for atdgen.
</p>

<p>
The goal is to modernize the implementation and make it easier to extend,
while keeping compatibility with existing ATD workflows.
</p>

<p>
Here's a sample input file <code>example.atd</code>:
</p>
<pre class="example" id="org66feb81">
type location = {
  row: int;
  column: int;
  ?file: string option;
}
</pre>

<p>
Atdml is invoked as follows, normally by the build system:
</p>
<pre class="example" id="org2686dc1">
$ atdml example.atd
</pre>

<p>
It produces a pair of mli and ml files. This is <code>example.mli</code>:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #8f6f4a; font-style: italic;">(* </span><span style="color: #8f6f4a; font-style: italic;">Auto-generated from "example.atd" by atdml.</span><span style="color: #8f6f4a; font-style: italic;"> *)</span>

<span style="color: #242521; font-weight: bold;">type</span> <span style="color: #444fcf; font-weight: bold;">location</span> = {
  row: int;
  column: int;
  file: string option;
}

<span style="color: #242521; font-weight: bold;">val</span> <span style="color: #a7601f;">create_location</span> : <span style="color: #444fcf; font-weight: bold;">row</span>:int -&gt; <span style="color: #444fcf; font-weight: bold;">column</span>:int -&gt; <span style="color: #444fcf; font-weight: bold;">?file</span>:string -&gt; unit -&gt; location
<span style="color: #242521; font-weight: bold;">val</span> <span style="color: #a7601f;">location_of_yojson</span> : <span style="color: #557400; font-weight: bold;">Yojson.Safe.</span>t -&gt; location
<span style="color: #242521; font-weight: bold;">val</span> <span style="color: #a7601f;">yojson_of_location</span> : location -&gt; <span style="color: #557400; font-weight: bold;">Yojson.Safe.</span>t
<span style="color: #242521; font-weight: bold;">val</span> <span style="color: #a7601f;">location_of_json</span> : string -&gt; location
<span style="color: #242521; font-weight: bold;">val</span> <span style="color: #a7601f;">json_of_location</span> : location -&gt; string

<span style="color: #242521; font-weight: bold;">module</span> <span style="color: #557400; font-weight: bold;">Location</span> : <span style="color: #242521; font-weight: bold;">sig</span>
  <span style="color: #242521; font-weight: bold;">type</span> <span style="color: #242521; font-weight: bold;">nonrec</span> <span style="color: #444fcf; font-weight: bold;">t</span> = location
  <span style="color: #242521; font-weight: bold;">val</span> <span style="color: #a7601f;">create</span> : <span style="color: #444fcf; font-weight: bold;">row</span>:int -&gt; <span style="color: #444fcf; font-weight: bold;">column</span>:int -&gt; <span style="color: #444fcf; font-weight: bold;">?file</span>:string -&gt; unit -&gt; t
  <span style="color: #242521; font-weight: bold;">val</span> <span style="color: #a7601f;">of_yojson</span> : <span style="color: #557400; font-weight: bold;">Yojson.Safe.</span>t -&gt; t
  <span style="color: #242521; font-weight: bold;">val</span> <span style="color: #a7601f;">to_yojson</span> : t -&gt; <span style="color: #557400; font-weight: bold;">Yojson.Safe.</span>t
  <span style="color: #242521; font-weight: bold;">val</span> <span style="color: #a7601f;">of_json</span> : string -&gt; t
  <span style="color: #242521; font-weight: bold;">val</span> <span style="color: #a7601f;">to_json</span> : t -&gt; string
<span style="color: #242521; font-weight: bold;">end</span>
</code></pre>
</div>

<p>
Release notes:
<a href="https://github.com/ahrefs/atd/releases/tag/4.0.0">https://github.com/ahrefs/atd/releases/tag/4.0.0</a>
</p>

<p>
Documentation:
<a href="https://atd.readthedocs.io/">https://atd.readthedocs.io/</a>
</p>

<p>
Project page:
<a href="https://github.com/ahrefs/atd">https://github.com/ahrefs/atd</a>
</p>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">Experimental module imports in ATD (ATD 4.0.0)</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-experimental-module-imports-in-atd-atd-4-0-0/17909/1">https://discuss.ocaml.org/t/ann-experimental-module-imports-in-atd-atd-4-0-0/17909/1</a>
</p>
</div>
<div id="outline-container-orgc57b582" class="outline-3">
<h3 id="orgc57b582">Martin Jambon announced</h3>
<div class="outline-text-3" id="text-orgc57b582">
<p>
ATD 4.0.0 adds experimental support for imports between ATD files.
</p>

<p>
This allows splitting schemas across multiple files in a natural way.
</p>

<p>
Currently supported in:
</p>
<ul class="org-ul">
<li>atdml (OCaml)</li>
<li>atdpy (Python)</li>
<li>atdts (TypeScript)</li>
</ul>

<p>
Example:
</p>
<pre class="example" id="orgdc8527d">
from utils as u import email

type email_addresses = u.email list
</pre>

<p>
Details:
<a href="https://github.com/ahrefs/atd/releases/tag/4.0.0">https://github.com/ahrefs/atd/releases/tag/4.0.0</a>
</p>

<p>
For an earlier discussion of the design, see <a href="https://discuss.ocaml.org/t/rfc-multifile-atd-definition-support-via-import-statements/17881">https://discuss.ocaml.org/t/rfc-multifile-atd-definition-support-via-import-statements/17881</a>].
</p>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">Dune 3.22</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-3-22/17912/1">https://discuss.ocaml.org/t/ann-dune-3-22/17912/1</a>
</p>
</div>
<div id="outline-container-orgcc413e6" class="outline-3">
<h3 id="orgcc413e6">Shon announced</h3>
<div class="outline-text-3" id="text-orgcc413e6">
<p>
The Dune team is pleased to announce <a href="https://github.com/ocaml/dune/releases/tag/3.22.0">the release of dune 3.22.0</a>.
</p>

<p>
In addition to many fixes and small improvements, notable highlights of this release include:
</p>

<ul class="org-ul">
<li>Fixes to the dune cache on Windows, thanks to <a href="https://github.com/Nevor">@Nevor</a> in <a href="https://github.com/ocaml/dune/pull/13713">ocaml/dune#13713</a>.</li>
<li>New tracing functionality, to inspect and diagnose the build processes thanks to <a href="https://github.com/rgrinberg">@rgrinberg</a> across many PRs. See <a href="https://dune.readthedocs.io/en/stable/hacking.html#inspecting-traces-with-jq">the documentation</a>.</li>
<li>Addition of the <code>dune-action-trace</code> library, to instrument trace emission, thanks to <a href="https://github.com/rgrinberg">@rgrinberg</a>.</li>
<li>Support for generating odoc documentation in markdown via the <code>@doc-markdown</code> build alias thanks to <a href="https://github.com/davesnx">@davesnx</a> <a href="https://github.com/ocaml/dune/pull/12581">ocaml/dune#12581</a>.</li>
<li>Full support for OxCaml's parameterised libraries, thanks to  <a href="https://github.com/art-w">@art-w</a> and  <a href="https://github.com/maiste">@maiste</a>. To learn more, see <a href="https://dune.readthedocs.io/en/stable/tutorials/oxcaml-parameterized-library/index.html">the docs</a>.</li>
</ul>

<p>
See <a href="https://github.com/ocaml/dune/releases/tag/3.22.0">the full changelog</a>
for all new features and fixes, and for attribution to the contributors who made
it all possible. Thank you, contributors!
</p>

<p>
If you encounter a problem with this release, please report it in <a href="https://github.com/ocaml/dune/issues">our issue
tracker</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">Parseff: parser combinator library for OCaml 5</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-parseff-parser-combinator-library-for-ocaml-5/17914/1">https://discuss.ocaml.org/t/ann-parseff-parser-combinator-library-for-ocaml-5/17914/1</a>
</p>
</div>
<div id="outline-container-org218e0b6" class="outline-3">
<h3 id="org218e0b6">David Sancho announced</h3>
<div class="outline-text-3" id="text-org218e0b6">
<p>
Hi everyone,
</p>

<p>
I’m sharing <b>Parseff</b>, a parser combinator library for <b>OCaml 5</b>.
</p>

<p>
If you like parser combinators but don’t love writing everything in monadic style, Parseff is built for that. Parsers are plain functions (<code>unit -&gt; 'a</code>) and you compose them in direct style, while Parseff handles backtracking and streaming under the hood (using effects!)
</p>
</div>
<div id="outline-container-org9b514fe" class="outline-4">
<h4 id="org9b514fe">Why Parseff</h4>
<div class="outline-text-4" id="text-org9b514fe">
<ul class="org-ul">
<li><b>Direct-style API</b>: write sequential OCaml code, no <code>&gt;&gt;=</code>, <code>let*</code>, or applicative operator chains required.</li>
<li><b>Typed errors</b>: raise domain errors with polymorphic variants via <code>Parseff.error</code>.</li>
<li><b>Streaming input</b>: same parser works with <code>Parseff.parse</code> (string) and <code>Parseff.parse_source</code> (stream).</li>
<li><b>Zero-copy + fused ops</b>: span APIs and fused operations for hot parsing paths.</li>
<li><b>Domain-safe execution</b>: parse calls are self-contained (no global mutable state).</li>
<li>Automatic backtracking with <a href="https://davesnx.github.io/parseff/api/combinators/#or_"><code>Parseff.or_</code></a></li>
<li>Minimal dependency footprint: only <code>re</code> for regex</li>
</ul>
</div>
</div>
<div id="outline-container-orgf90f8ad" class="outline-4">
<h4 id="orgf90f8ad">Performance</h4>
<div class="outline-text-4" id="text-orgf90f8ad">
<p>
In the included benchmarks, Parseff is faster than Angstrom and MParser:
</p>

<ul class="org-ul">
<li>around <b>~2x</b> in fair comparisons</li>
<li>up to <b>~4x+</b> with zero-copy optimized paths</li>
</ul>
<p>
Benchmark details and code are in the repo docs.
</p>

<p>
## Documentation
</p>

<p>
I’ve put a lot of effort into the docs (quick start, guides, and API pages) to keep Parseff easy to learn. A bit proud of using odoc’s Markdown backend plus mdx, I can generate and check examples on the fly, so snippets stay type-safe.
</p>

<p>
<a href="https://davesnx.github.io/parseff">https://davesnx.github.io/parseff</a>
</p>
</div>
</div>
<div id="outline-container-org9267b54" class="outline-4">
<h4 id="org9267b54">Install</h4>
<div class="outline-text-4" id="text-org9267b54">
<pre class="example" id="orgd48892d">
opam install parseff -y
</pre>
</div>
</div>
<div id="outline-container-org6d82316" class="outline-4">
<h4 id="org6d82316">Links</h4>
<div class="outline-text-4" id="text-org6d82316">
<ul class="org-ul">
<li>Docs: <a href="https://davesnx.github.io/parseff/">https://davesnx.github.io/parseff/</a></li>
<li>Comparison guide: <a href="https://davesnx.github.io/parseff/guides/comparison/">https://davesnx.github.io/parseff/guides/comparison/</a></li>
<li>GitHub: <a href="https://github.com/davesnx/parseff">https://github.com/davesnx/parseff</a></li>
</ul>

<p>
If you try it, I’d really value feedback on: API ergonomics, error handling experience or  missing combinators or docs gaps!
</p>

<p>
Thanks!
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="5">Outreachy Demo Day for December 2025 Round</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/outreachy-demo-day-for-december-2025-round/17883/5">https://discuss.ocaml.org/t/outreachy-demo-day-for-december-2025-round/17883/5</a>
</p>
</div>
<div id="outline-container-orga3339df" class="outline-3">
<h3 id="orga3339df">Continuing this thread, Patrick Ferris announced</h3>
<div class="outline-text-3" id="text-orga3339df">
<p>
The recording of our (nearly two hour!) meeting is now online: <a href="https://watch.ocaml.org/w/8aUqMhFvhQGq4WJLH3ukjA">https://watch.ocaml.org/w/8aUqMhFvhQGq4WJLH3ukjA</a> !
</p>

<p>
Thank you to everyone who joined :two_hump_camel:
</p>
</div>
</div>
</div>
<div id="outline-container-org45c9929" class="outline-2">
<h2 id="org45c9929">Old CWN</h2>
<div class="outline-text-2" id="text-org45c9929">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="orgd01364e">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
